package E7_¹è¿­7_¾Ë°í¸®Áò;

import java.util.Scanner;

public class ¹è¿­7_¾Ë°í¸®Áò_È¸Àü_¹®Á¦ {

	public static void main(String[] args) {
		/*
		 * ¹®Á¦)  ¾Æ·¡ ¸í·É¾î¸¦ ÀÔ·Â¹ÞÀ»¶§¸¶´Ù block¹è¿­À» 90µµ È¸ÀüÇØº¸¼¼¿ä.
		 * [1.left_turn] [2.right_turn]
		 * 
		 * ¿¹) [1.left_turn] (¿ÞÂÊÀ¸·Î 90µµ È¸Àü)
		 * 
		 * 4 8 12 16
		 * 3 7 11 15
		 * 2 6 10 14
		 * 1 5 9  13
		 */
		
			int block[][] = {
					{1,2,3,4},
					{5,6,7,8},
					{9,10,11,12},
					{13,14,15,16},
			};
			// 1 : 0,0 -> 3Ä­ÀÌµ¿ -> 3,0 -> 3Ä­ÀÌµ¿ -> 3,3 -> 3Ä­ÀÌµ¿ -> 0,3 -> 3Ä­ÀÌµ¿ -> 0,0
			//     0,1 -> 3Ä­ÀÌµ¿ -> 2,0 -> 3Ä­ÀÌµ¿ -> 3,2 -> 3Ä­ÀÌµ¿ -> 1,3 -> 3Ä­ÀÌµ¿ -> 0,1
			//     0,2 -> 3Ä­ÀÌµ¿ -> 1,0 -> 3Ä­ÀÌµ¿ -> 3,1 -> 3Ä­ÀÌµ¿ -> 2,3 -> 3Ä­ÀÌµ¿ -> 0,2
			//     0,3 -> 3Ä­ÀÌµ¿ -> 0,0 -> 3Ä­ÀÌµ¿ -> 3,0 -> 3Ä­ÀÌµ¿ -> 3,3 -> 3Ä­ÀÌµ¿ -> 0,3
			
			// 2 : 0,0 -> 3Ä­ÀÌµ¿ -> 0,3 -> 3Ä­ÀÌµ¿ -> 3,3 -> 3Ä­ÀÌµ¿ -> 3,0 -> 3Ä­ÀÌµ¿ -> 0,0
			// 2 : 0,1 -> 3Ä­ÀÌµ¿ -> 1,3 -> 3Ä­ÀÌµ¿ -> 3,2 -> 3Ä­ÀÌµ¿ -> 2,0 -> 3Ä­ÀÌµ¿ -> 0,1
			// 2 : 0,2 -> 3Ä­ÀÌµ¿ -> 2,3 -> 3Ä­ÀÌµ¿ -> 3,1 -> 3Ä­ÀÌµ¿ -> 1,0 -> 3Ä­ÀÌµ¿ -> 0,2
			// 2 : 0,3 -> 3Ä­ÀÌµ¿ -> 3,3 -> 3Ä­ÀÌµ¿ -> 3,0 -> 3Ä­ÀÌµ¿ -> 0,0 -> 3Ä­ÀÌµ¿ -> 0,3
			Scanner scan = new Scanner(System.in);
			
			while(true) {
				System.out.println("[1.left_turn] [2.right_turn]");
				int n = scan.nextInt();
				for(int i = 0; i < block.length; i++) {
					
				}
				
			}
			
			

	}

}
